Revit 2026 API

# ConnectorElementRadius Property

---

The radius of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual double Radius { get; }
```
```vb
Public Overridable ReadOnly Property Radius As Double
	Get
```
```cpp
public:
virtual property double Radius {
	double get ();
}
```
```fsharp
abstract Radius : float with get
override Radius : float with get
```

#### Property Value

Double

#### Implements

IConnectorRadius

-1 if the connector is not round.

#### Reference

ConnectorElement Class

Autodesk.Revit.DB Namespace